//В файле содержится строка с исходными данными в такой форме:
//        {"name":"Ivanov", "country":"Russia", "city":"Moscow", "age":"null"}
//        Требуется на её основе построить и вывести на экран новую строку, в форме SQL запроса:
//        SELECT * FROM students WHERE name = "Ivanov" AND country = "Russia" AND city = "Moscow";
//
//        Для разбора строки используйте String.split.
//        Сформируйте новую строку, используя StringBuilder. Значения null не включаются в запрос.
public class secondSem {
    public static void main(String[] args) {
        System.out.println("Hi");
    }
}
